package NGS;

public class a40_array {

	public static void main(String[] args) {
		//변수는 선언하는 순간 저장공간이 만들어지지만 배열은 선언 후 생성해야 저장공간이 생성됨.
		//배열을 선언까지만 하면 그냥 배열을 다루기 위한 참조변수만 선언된 것.
		
		/*
		 * 배열 선언 방법		|	선언 예시
		 * --------------------------------------
		 * 타입[] 변수이름;		|	int[] score;		[]가 배열기호
		 * 					|	String[] name;
		 * 타입 변수이름[];		|	int	score[];
		 * 					|	String name[];
		 */
		
		/*
		 * 데이터타입[] 변수이름;				=> 배열을 선언 : 배열을 다루기 위한 참조변수를 선언
		 * 변수이름 = new 타입[length];		=> 배열을 생성 : 실제 저장공간이 생성됨)
		 */

		//int[] i;				//데이터형식이 int인 배열을 다루기 위해 참조변수 score를 선언했다
		//score = new int[5];		//데이터형식이 int인 값 5개를 저장할 수 있는 배열을 생성했다
		
		
		
		
		
		
		
	}
	
}
